//Floyd-zlh
#include<stdio.h>
#include<stdlib.h>
#define MAX 1000000
int d[100][100];
void main(){
	int i,j,k,n,m;//n为顶点数，m为边数
	int x,y,w;
	printf("请输入顶点数和边数：\n");
	scanf("%d %d",&n,&m);
	
	for(i=1;i<=n;i++){
		for(j=1;j<=n;j++){
			d[i][j] = MAX;
		}
	}

	printf("请输入各个顶点之间的带权路径（包括出发点，结束点，以及权值）：\n");
	for(i=0;i<m;i++){
		scanf("%d %d %d",&x,&y,&w);
		d[x][y] = w;
	}

	for(k=1;k<=n;k++){
		for(i=1;i<=n;i++){
			for(j=1;j<=n;j++){
				if(d[i][k] + d[k][j] < d[i][j]){
					d[i][j] = d[i][k] + d[k][j];
				}
			}
		}
	}

	for(i=1;i<=n;i++){
		for(j=1;j<=n;j++){
			if(i !=j)
				printf("%d->%d的最短路径是%d\n",i,j,d[i][j]);
		}
	}
	system("pause");
}
//请输入顶点数和边数：
//4 8
//请输入各个顶点之间的带权路径（包括出发点，结束点，以及权值）：
//1 2 2
//2 3 3
//1 3 6
//3 1 7
//1 4 4
//4 1 5
//3 4 1
//4 3 12
//1->2的最短路径是2
//1->3的最短路径是5
//1->4的最短路径是4
//2->1的最短路径是9
//2->3的最短路径是3
//2->4的最短路径是4
//3->1的最短路径是6
//3->2的最短路径是8
//3->4的最短路径是1
//4->1的最短路径是5
//4->2的最短路径是7
//4->3的最短路径是10